var zr_array = [{
    'number':1,
    'zr_Name': '元素冰皇',
    'jb_Name': '3元素4极地2暗影',
    'qianqitext':'前期优先大剑，布甲，腰带，大棒 可以用俩骑士俩游侠过渡或者冰女于寒冰组成2极地2骑士过渡',
    'zhoqitext':'中期可以用骑士游侠过渡或者3元素2极地2游侠过渡 冰女最好追3星 7人口：冰女，凯南，火男，寒冰，猪女，铁男，千珏就可以成型了 一般都有钱上8加个韦鲁斯，冰鸟来了可以替换掉凯南就可以有4极地了 控制能力提升一大截 或者另外一种思路，不来冰鸟就升8人口上个极地英雄凑 buff',
    'wftd':'由虎牙主播唐小潘推荐的暗影极地元素游侠 火男大招切后排 冰女凯南群体大招AOE输出爆表 控制输出于一身',
    'HeroS': [
        {
            'Hero': '寒冰射手',
            'core': true,
            'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
        }
        ,
        {
            'Hero': '冰霜女巫',
            'core': true,
            'zb':['守护天使','救赎','莫雷洛秘典']
        }
        ,
        {
            'Hero': '狂暴之心',
            'core': false, 
        }
        ,
        {
            'Hero': '复仇焰魂',
            'core': false, 
        }
        ,
        {
            'Hero': '北地之怒',
            'core': false, 
        }
        ,
        {
            'Hero': '永猎双子',
            'core': false, 
        },
        {
            'Hero': '铁铠冥魂',
            'core': false,
        }
    ],
    'qianqi':['冰霜女巫','寒冰射手','德玛西亚之力','铁铠冥魂'],
    'zhoqi':['冰霜女巫','寒冰射手','德玛西亚之力','铁铠冥魂','暗夜猎手'],
},
    {
        'number':2,
        'zr_Name': '狂暴刺客',
        'jb_Name': '4狂野3刺客3换形2海克斯',
        'qianqitext':'首轮选秀优先选拳套，其次选大剑。前期可以选择2狂野配高质量刺客过渡，无尽能做出来的话先给刺客打工仔劫，能打连胜可以早点升人口。',
        'zhoqitext':'打完石头人后上6人口，D一波，运气好的话找到阿卡丽和纳尔，6人口就可以凑成4狂野3刺，第三轮的强度几乎无敌，阿卡丽，纳尔来得晚，可以先用2星狮子狗撑着场面，保证血量健康的情况下存钱 第四轮升7人口可以补杰斯，配合纳尔，豹女开出三换形的羁绊，提高阵容的坦度，7人口的核心是两星阿卡丽，找到了即可存钱上8，8人口时补蔚，开出双海克斯双斗士。',
        'wftd':'由虎牙主播神超推荐的狂野刺阵容：4狂野为刺客提供必中效果，让阿卡丽，狮子狗不再怕约德尔的闪避。同时纳尔，杰斯，蔚的控制效果，很好弥补了阵容缺控制的短板，成型强度T1。',
        'HeroS': [
            {
                'Hero': '离群之刺',
                'core': true,
                'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
            }
            ,
            {
                'Hero': '傲之追猎者',
                'core': true,
                'zb':['守护天使','救赎','莫雷洛秘典']
            }
            ,
            {
                'Hero': '祖安怒兽',
                'core': false,
            }
            ,
            {
                'Hero': '狂野女猎手',
                'core': false,
            }
            ,
            {
                'Hero': '迷失之牙',
                'core': false,
            }
            ,
            {
                'Hero': '皮城执法官',
                'core': false,
            },
            {
                'Hero': '未来守护者',
                'core': false,
            }
        ],
        'qianqi':['祖安怒兽','狂野女猎手','影流之主','血港鬼影'],
        'zhoqi':['傲之追猎者','离群之刺','祖安怒兽','狂野女猎手','迷失之牙','血港鬼影'],
    },
    {
        'number':3,
        'zr_Name': '狂野龙法Pro',
        'jb_Name': '4狂野3发生2龙',
        'qianqitext':'因为装备主要出法术装备，让狐狸先带上法术装备过度，之后再给龙王。',
        'zhoqitext':'8人口时候也有不同思路，可以考虑拆掉狼人和豹女，凑出六法师。6法师+龙女/潘森+纳尔，留下狂野和双龙。',
        'wftd':'由企鹅电竞丶Misaya若风推荐的阵容，给龙王合成珠光护手，伤害瞬间爆炸！',
        'HeroS': [
            {
                'Hero': '迷失之牙',
                'core': true,
                'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
            }
            ,
            {
                'Hero': '铸星龙王',
                'core': true,
                'zb':['守护天使','救赎','莫雷洛秘典']
            }
            ,
            {
                'Hero': '祖安怒兽',
                'core': false,
            }
            ,
            {
                'Hero': '狂野女猎手',
                'core': false,
            }
            ,
            {
                'Hero': '九尾妖狐',
                'core': false,
            }
            ,
            {
                'Hero': '卡牌大师',
                'core': false,
            }
            ,
            {
                'Hero': '屠龙勇士',
                'core': false,
            }
            ,
            {
                'Hero': '龙血武姬',
                'core': false,
            }
        ],
        'qianqi':['祖安怒兽','狂野女猎手','卡牌大师','九尾妖狐'],
        'zhoqi':['祖安怒兽','狂野女猎手','卡牌大师','九尾妖狐','仙灵女巫'],
    },
    {
        'number':4,
        'zr_Name': '虚空斗刃刺',
        'jb_Name': '4虚空4斗士3刺客2海克斯1忍者',
        'qianqitext':'这套阵容八人口成型，在前期尽量多存经济上人口。目前版本血量比之前扣得最少前期可以卖血存经济和拿手套。',
        'zhoqitext':'在中期有盗窃手套可以给劫或狮子狗打工；谁二星给谁。阵容中期靠白嫖。经济在八人口用掉，将阵容提升完全体。',
        'wftd':'由企鹅的主播Dae丶夜大猫子推荐的阵容。别问，问就是俩星卡莎等于吃鸡。',
        'HeroS': [
            {
                'Hero': '离群之刺',
                'core': true,
                'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
            }
            ,
            {
                'Hero': '虚空之女',
                'core': true,
                'zb':['守护天使','救赎','莫雷洛秘典']
            }
            ,
            {
                'Hero': '虚空掠夺者',
                'core': false,
            }
            ,
            {
                'Hero': '虚空遁地兽',
                'core': false,
            }
            ,
            {
                'Hero': '虚空恐惧',
                'core': false,
            }
            ,
            {
                'Hero': '蒸汽机器人',
                'core': false,
            }
            ,
            {
                'Hero': '皮城执法官',
                'core': false,
            }
            ,
            {
                'Hero': '暴走萝莉',
                'core': false,
            }
        ],
        'qianqi':['祖安怒兽','狂野女猎手','虚空掠夺者','虚空遁地兽'],
        'zhoqi':['虚空掠夺者','傲之追猎者','影流之主','虚空遁地兽','祖安怒兽'],
    }
    ,
    {
        'number':5,
        'zr_Name': '霍比特人',
        'jb_Name': '6约3法双龙',
        'qianqitext':'前期3贵族双枪打工稳血一流、装备能给的尽量给上、如有卢登可优先给卢锡安、前中期吃连胜经济。',
        'zhoqitext':'3阶段先把体系雏形弄出来、如3法3约、抽到火男可再开启3元素打工、然后攒钱吃利息等升7人口-一般情况下4-1升7然后一波血抽 拉质量 凑6约德尔人3法双龙、6约一出吊打任何物理阵容、把卡都升到2就是完全体、后期拉人口找橙卡提升强度。此套霍比特人体系唯一克星狂野龙法。',
        'wftd':'由虎牙主播失心狂乱推荐的龙约，能扛能打、有控制、有爆发、并且不太吃装备、7人口成型，成型后恶心死人不偿命。',
        'HeroS': [
            {
                'Hero': '龙血武姬',
                'core': true,
                'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
            }
            ,
            {
                'Hero': '铸星龙王',
                'core': true,
                'zb':['守护天使','救赎','莫雷洛秘典']
            }
            ,
            {
                'Hero': '迷失之牙',
                'core': false,
            }
            ,
            {
                'Hero': '仙灵女巫',
                'core': false,
            }
            ,
            {
                'Hero': '狂暴之心',
                'core': false,
            }
            ,
            {
                'Hero': '邪恶小法师',
                'core': false,
            }
            ,
            {
                'Hero': '圣锤之毅',
                'core': false,
            }
            ,
            {
                'Hero': '屠龙勇士',
                'core': false,
            }
        ],
        'qianqi':['德玛西亚之力','圣枪游侠','无双剑姬','麦林炮手'],
        'zhoqi':['铸星龙王','邪恶小法师','狂暴之心','圣锤之毅','迷失之牙','仙灵女巫','龙血武姬'],
    }
    ,
    {
        'number':6,
        'zr_Name': '新骑士帝国',
        'jb_Name': '4骑士4帝国双暗隐',
        'qianqitext':'开局选秀优先暴击拳套，攻速，其次魔抗，护甲。 有骑士留骑士，3级用双骑士加一个输出或者三贵族过度，4级双骑双枪（双游侠也可以维鲁斯加VN不要艾希因为艾希输出没有维鲁斯高）或者双骑三贵，5级4骑士加一个输出或者双骑三贵加输出 ',
        'zhoqitext':'六级四骑士双枪或者四骑士双游侠，7级四骑士四帝国或者四骑士双帝国加双枪或者双游侠，八级四骑士四帝国加双暗影。 阵容要点：骑士帝国的过度很灵活多变，把四骑士看出前排加控制即可，所以我们只用拿有输出的打工仔安全过度到乌鸦德莱文来即可，打工仔推荐：卢锡安加小炮的双枪，维鲁斯加VN双游侠，狐狸加豹女双狂野，诺手加卡特（可以给卡特输出装 后期再买一只卡特换掉即可）双帝国，因为装备改版之后火炮不是必中了，因此德莱文带火炮打有狂徒绿茶的龙女没有以前的优势了，所以我们在德莱文的装备选择上得变一变了，以前的火炮，鬼刀，饮血剑改成无尽，火炮，龙牙即可！',
        'wftd':'由斗鱼直播主播斗鱼小泽推荐阵容：【新骑士帝国】 卡特已经增强了两个版本了 加上窃贼手套的缘故 三个输出位的帝国更加强势了',
        'HeroS': [
            {
                'Hero': '不祥之刃',
                'core': true,
                'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
            }
            ,
            {
                'Hero': '荣耀执行官',
                'core': true,
                'zb':['守护天使','救赎','莫雷洛秘典']
            }
            ,
            {
                'Hero': '诺克萨斯统领',
                'core': true,
            }
            ,
            {
                'Hero': '诺克萨斯之手',
                'core': false,
            }
            ,
            {
                'Hero': '正义天使',
                'core': false,
            }
            ,
            {
                'Hero': '北地之怒',
                'core': false,
            }
            ,
            {
                'Hero': '铁铠冥魂',
                'core': false,
            }
            ,
            {
                'Hero': '永猎双子',
                'core': false,
            }
        ],
        'qianqi':['荣耀执行官','圣锤之毅','诺克萨斯之手','铁铠冥魂'],
        'zhoqi':['荣耀执行官','北地之怒','诺克萨斯之手','铁铠冥魂','正义天使','永猎双子','诺克萨斯统领','不祥之刃'],
    }
    ,
    {
        'number':7,
        'zr_Name': '矮子蹦迪流',
        'jb_Name': '6法师3约德人2骑士2虚空2暗影',
        'qianqitext':'6人口成型：3约德尔6法师。先出骑士和约德尔来过渡，卡牌作为6法师的涡轮增加可以提高放技能频率，波比转化猫咪后联合璐璐无限蹦迪（击飞）。',
        'zhoqitext':'后期莫甘娜换死歌，加上前期打工铁男凑成暗影buff开局抽奖；主C为波比也有骑士buff提高防御以及蹦迪璐璐提高生存。',
        'wftd':'由斗鱼直播主播山东棋王弈哥推荐的阵容：【矮子蹦迪流】围绕当前版本大热的约德尔人和被遗忘的六法阵容。棋子和装备都比较好拿，同时也克制当前依靠普攻输出的游侠、刺客等阵容。',
        'HeroS': [
            {
                'Hero': '圣锤之毅',
                'core': true,
                'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
            }
            ,
            {
                'Hero': '仙灵女巫',
                'core': true,
                'zb':['守护天使','救赎','莫雷洛秘典']
            }
            ,
            {
                'Hero': '卡牌大师',
                'core': true,
            }
            ,
            {
                'Hero': '邪恶小法师',
                'core': false,
            }
            ,
            {
                'Hero': '虚空行者',
                'core': false,
            }
            ,
            {
                'Hero': '死亡颂唱者',
                'core': false,
            }
            ,
            {
                'Hero': '虚空恐惧',
                'core': false,
            }
            ,
            {
                'Hero': '永猎双子',
                'core': false,
            }
        ],
        'qianqi':['仙灵女巫','圣锤之毅','德玛西亚之力','铁铠冥魂','邪恶小法师'],
        'zhoqi':['仙灵女巫','圣锤之毅','卡牌大师','虚空行者','邪恶小法师','堕落天使'],
    }
    ,
    {
        'number':8,
        'zr_Name': '凛冬骑冰流',
        'jb_Name': '4骑士2护卫2极地',
        'qianqitext':'前期先凑冰女装备，鬼书，龙牙，科技枪/狂徒。正常赌狗节奏，4升5人口前，狂搜一波，四骑和冰女留牌，波比只要到二。因为这版本掉血少，连败拿装备的打法也适用。',
        'zhoqitext':'后期花钱D潘森，也可以上8人口凑4极地',
        'wftd':'由斗鱼直播主播炬合丶梨落推荐的阵容，克制当前版本以卡莎为主C的阵容。',
        'HeroS': [
            {
                'Hero': '冰霜女巫',
                'core': true,
                'zb':['折剑者','朔极之矛','鬼索的狂暴之刃']
            }
            ,
            {
                'Hero': '德玛西亚之力',
                'core': true,
                'zb':['守护天使','救赎','莫雷洛秘典']
            }
            ,
            {
                'Hero': '诺克萨斯之手',
                'core': false,
            }
            ,
            {
                'Hero': '铁铠冥魂',
                'core': false,
            }
            ,
            {
                'Hero': '北地之怒',
                'core': false,
            }
            ,
            {
                'Hero': '屠龙勇士',
                'core': false,
            }
            ,
            {
                'Hero': '曙光女神',
                'core': false,
            }
            
        ],
        'qianqi':['德玛西亚之力','诺克萨斯之手','铁铠冥魂','圣锤之毅'],
        'zhoqi':['德玛西亚之力','诺克萨斯之手','铁铠冥魂','圣锤之毅','冰霜女巫','弗雷尔卓德之心'],
    }
];